## Manipulation using Pandas:

In [ ]:
import pandas as pd 

df = pd.read_csv("practice.csv", encoding='windows-1252')
df.head(3)

In [ ]:
# df.isnull().sum()
dfnew =df.fillna("not defined")
# df = dfnew ## to make permanenet changes
# df

df["Monthly Salary"]= df["Monthly Salary"].fillna(df["Monthly Salary"].mean())
df

In [ ]:
## renaming columns 
df.rename(columns={"Emp ID":"ID"})

In [ ]:
# changing data types 
df["new salary"] = df['Monthly Salary'].astype(int)
df.head()

In [ ]:
def addone(x):
    return x+10
df["new salary"] =df['Monthly Salary'].astype(int).apply(addone) ## or add a lambda function 
df.head()

In [ ]:
# grouping 
def title(x):
    return x.title()
df["Country"]=df["Country"].apply(title)
df["Department"]=df["Department"].apply(title)
df
groupedsales  = df.groupby(['Country','Department'])["new salary"].sum()
print(groupedsales)

In [ ]:
## aggergate multiple 
groupedsales  = df.groupby(['Country','Department'])["new salary"].agg(["sum","mean","count"])
print(groupedsales)

### Merging and Joining DataFrames

In [159]:
df1 = pd.DataFrame({"Key":['A',"B","C"],"Value1":[1,2,3]})
df2 = pd.DataFrame({"Key":['A',"B","D","E"],"Value2":[4,5,6,7]})
print(df1)
print(df2)

  Key  Value1
0   A       1
1   B       2
2   C       3
  Key  Value2
0   A       4
1   B       5
2   D       6
3   E       7

In [ ]:
## merging
pd.merge(df1,df2,on="Key",how="inner") ## common merges

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [163]:
pd.merge(df1,df2,on="Key",how="outer") ## both merges

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0
4   E     NaN     7.0

In [166]:
pd.merge(df1,df2,on="Key",how="left") ## left  one isgiven priority

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [ ]:
pd.merge(df1,df2,on="Key",how="right") ## rigth one is given priority

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6
3   E     NaN       7